ningjw/LPC55S69/core0/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitPins(void)
{
    /* Enables the clock for the Input Mux.: Enable Clock. */
    CLOCK_EnableClock(kCLOCK_InputMux);
    /* Enables the clock for the I/O controller.: Enable Clock. */
    CLOCK_EnableClock(kCLOCK_Iocon);

    /* Enables the clock for the GPIO0 module */
    CLOCK_EnableClock(kCLOCK_Gpio0);

    /* Enables the clock for the GPIO1 module */
    CLOCK_EnableClock(kCLOCK_Gpio1);

    gpio_pin_config_t ADC_MODE_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_7 (pin G5)  */
    GPIO_PinInit(BOARD_ADC_MODE_GPIO, BOARD_ADC_MODE_PORT, BOARD_ADC_MODE_PIN, &ADC_MODE_config);

    gpio_pin_config_t ADC_SYNC_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_16 (pin J2)  */
    GPIO_PinInit(BOARD_ADC_SYNC_GPIO, BOARD_ADC_SYNC_PORT, BOARD_ADC_SYNC_PIN, &ADC_SYNC_config);

    gpio_pin_config_t BAT_STDBY_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_17 (pin G3)  */
    GPIO_PinInit(BOARD_BAT_STDBY_GPIO, BOARD_BAT_STDBY_PORT, BOARD_BAT_STDBY_PIN, &BAT_STDBY_config);

    gpio_pin_config_t NB_RELOAD_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_18 (pin H9)  */
    GPIO_PinInit(BOARD_NB_RELOAD_GPIO, BOARD_NB_RELOAD_PORT, BOARD_NB_RELOAD_PIN, &NB_RELOAD_config);

    gpio_pin_config_t LED_BLE_RED_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_19 (pin E6)  */
    GPIO_PinInit(BOARD_LED_BLE_RED_GPIO, BOARD_LED_BLE_RED_PORT, BOARD_LED_BLE_RED_PIN, &LED_BLE_RED_config);

    gpio_pin_config_t LED_BLE_GREEN_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_20 (pin B12)  */
    GPIO_PinInit(BOARD_LED_BLE_GREEN_GPIO, BOARD_LED_BLE_GREEN_PORT, BOARD_LED_BLE_GREEN_PIN, &LED_BLE_GREEN_config);

    gpio_pin_config_t ADC_RDY_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_21 (pin A12)  */
    GPIO_PinInit(BOARD_ADC_RDY_GPIO, BOARD_ADC_RDY_PORT, BOARD_ADC_RDY_PIN, &ADC_RDY_config);

    gpio_pin_config_t PWR_OFF_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_24 (pin E12)  */
    GPIO_PinInit(BOARD_PWR_OFF_GPIO, BOARD_PWR_OFF_PORT, BOARD_PWR_OFF_PIN, &PWR_OFF_config);

    gpio_pin_config_t PWR_5V_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_25 (pin A11)  */
    GPIO_PinInit(BOARD_PWR_5V_GPIO, BOARD_PWR_5V_PORT, BOARD_PWR_5V_PIN, &PWR_5V_config);

    gpio_pin_config_t NB_ST_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_29 (pin H8)  */
    GPIO_PinInit(BOARD_NB_ST_GPIO, BOARD_NB_ST_PORT, BOARD_NB_ST_PIN, &NB_ST_config);

    gpio_pin_config_t BAT_CHRG_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_0 (pin E1)  */
    GPIO_PinInit(BOARD_BAT_CHRG_GPIO, BOARD_BAT_CHRG_PORT, BOARD_BAT_CHRG_PIN, &BAT_CHRG_config);

    gpio_pin_config_t TEMP_ALT_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_1 (pin G11)  */
    GPIO_PinInit(BOARD_TEMP_ALT_GPIO, BOARD_TEMP_ALT_PORT, BOARD_TEMP_ALT_PIN, &TEMP_ALT_config);

    gpio_pin_config_t LED_SYS_RED_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_2 (pin G12)  */
    GPIO_PinInit(BOARD_LED_SYS_RED_GPIO, BOARD_LED_SYS_RED_PORT, BOARD_LED_SYS_RED_PIN, &LED_SYS_RED_config);

    gpio_pin_config_t LED_SYS_GREEN_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_3 (pin G13)  */
    GPIO_PinInit(BOARD_LED_SYS_GREEN_GPIO, BOARD_LED_SYS_GREEN_PORT, BOARD_LED_SYS_GREEN_PIN, &LED_SYS_GREEN_config);

    gpio_pin_config_t PWR_CHG_COMPLETE_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_6 (pin H5)  */
    GPIO_PinInit(BOARD_PWR_CHG_COMPLETE_GPIO, BOARD_PWR_CHG_COMPLETE_PORT, BOARD_PWR_CHG_COMPLETE_PIN, &PWR_CHG_COMPLETE_config);

    gpio_pin_config_t PWR_ADC_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_10 (pin J7)  */
    GPIO_PinInit(BOARD_PWR_ADC_GPIO, BOARD_PWR_ADC_PORT, BOARD_PWR_ADC_PIN, &PWR_ADC_config);

    gpio_pin_config_t LED_BAT_RED_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_14 (pin L7)  */
    GPIO_PinInit(BOARD_LED_BAT_RED_GPIO, BOARD_LED_BAT_RED_PORT, BOARD_LED_BAT_RED_PIN, &LED_BAT_RED_config);

    gpio_pin_config_t LED_BAT_GREEN_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_15 (pin B6)  */
    GPIO_PinInit(BOARD_LED_BAT_GREEN_GPIO, BOARD_LED_BAT_GREEN_PORT, BOARD_LED_BAT_GREEN_PIN, &LED_BAT_GREEN_config);

    gpio_pin_config_t NB_PWR_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_24 (pin F6)  */
    GPIO_PinInit(BOARD_NB_PWR_GPIO, BOARD_NB_PWR_PORT, BOARD_NB_PWR_PIN, &NB_PWR_config);

    gpio_pin_config_t BT_RST_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO1_25 (pin B8)  */
    GPIO_PinInit(BOARD_BT_RST_GPIO, BOARD_BT_RST_PORT, BOARD_BT_RST_PIN, &BT_RST_config);

